'''使用print方式进行输出（输出地是文件）'''

fp=open('D:/test.txt','a+')
print('奋斗成就更好的你',file=fp)
fp.close()


'''第二种方式，使用文件读写能力'''

with open('D:/test.txt','a+') as file:
    file.write('奋斗成就更好的你')



#输出北京的天气预报
print('星期天','今天')
print('--------------------------')
print('08时','11时','14时','17时','20时','23时')
print('0℃ ','6℃ ','10℃','  4',' 1℃',' 0℃')
print('--------------------------')
print('明  天',' 2/23','2℃/11℃')
print('星期二',' 2/24','2℃/11℃')
print('星期三',' 2/25','2℃/11℃')
print('星期四',' 2/26','2℃/11℃')
print('星期五',' 2/27','2℃/11℃')
print('星期六',' 2/28','2℃/11℃')
print('星期天',' 2/29','2℃/11℃')

